*&---------------------------------------------------------------------*
*& Report ZRMM4090
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*& Module              : MM
*& Program ID          : ZRMM4090
*& T-CODE              : ZRMM4090
*& Referenced Program  : N/A
*& Created by          : T0210051
*& Created On          : 2021.05.17
*& Type                : R
*& Description         : 입고 예정 정보 송신 관리
*&---------------------------------------------------------------------*
*& Change History
*&---------------------------------------------------------------------*
*& 변경SEQ    변경자        변경일자             변경내용
*&---------------------------------------------------------------------*
*&    N       T0210051      2021.05.17          최초생성
*&    U1      T0210051      2022.03.04         삭제 PO 재전송 추가
*&    U2      T0210054     2022.04.25          KGC-2050 전송 시 배치정보 SORT 추가
*&    U3      T0210054     2022.05.19          변경 PO 재전송 기능 추가(EKPO 테이블 정보로 구성)
*&---------------------------------------------------------------------*
REPORT ZRMM4090 MESSAGE-ID ZCN00 LINE-SIZE 80.

INCLUDE ZRMM4090TOP.        "Top Include
INCLUDE ZRMM4090CLS.        "ALV/TREE Class
INCLUDE ZRMM4090SCR.        "Selection Screen
INCLUDE ZRMM4090O01.        "Process Before Output
INCLUDE ZRMM4090I01.         "Process After Input
INCLUDE ZRMM4090F01.        "Business Logic Routine
INCLUDE ZRMM4090F02.        "ALV /Tree Logic Routine

*----------------------------------------------------------------------*
* Initialization
*----------------------------------------------------------------------*
INITIALIZATION.
  PERFORM INITIALIZATION.

*----------------------------------------------------------------------*
* START-OF-SELECTION                                                   *
*----------------------------------------------------------------------*
START-OF-SELECTION.

  PERFORM CHECK_AUTHORITY.  "권한체크가 필요한 경우

  PERFORM GET_DATA.

*----------------------------------------------------------------------*
* END-OF-SELECTION                                                     *
*----------------------------------------------------------------------*
END-OF-SELECTION.
